app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("created_at", "descripcion", "imagen", "nombre", "precio", "updated_at") VALUES (?, ?, ?, ?, ?, ?)