app/controllers/public_controller.rb

	def index
		@productos = Product.all
---
SELECT "products".* FROM "products"